//=======================================Copyright(c)====================================
// 											欣旺达电子股份有限公司
//											研发三部软件小组
//												软件部 
//-------------------------------------------------文件信息------------------------------
//文件名		: general.h  
//创建人		: 
//创建日期		:  
//描	述		: 公共的头文件
//-----------------------------------------------当前版本修订----------------------------
//修改人		:
//版	本		: 
//修改日期		:
//描	述		:
//=======================================================================================
#ifndef _BSP_TYPEDEF_H
#define _BSP_TYPEDEF_H

//============================================================================
//								宏参数定义
//============================================================================
#define DEBUG_EN    1

#ifndef TRUE
#define TRUE	1
#endif

#ifndef FALSE
#define FALSE	0 
#endif

#ifndef OK
#define OK      0
#endif

 


//============================================================================
//							宏函数定义
//============================================================================
#define BITSET(x, y)			((x) |= ((u8)1 << (y)))
#define BITCLR(x, y)			((x) &= ~((u8)1 << (y)))
#define BITGET(x, y)            ((u8)(((x) & ((u8)1 << (y))) >> (y)))

#define BITSET32(x, y)		    ((x) |= ((u32)1 << (y)))
#define BITCLR32(x, y)		    ((x) &= ~((u32)1 << (y)))
#define BITGET32(x, y)          ((x & ((u32)1 << (y))) >> (y))
#define IsEqual(x, y)           ((x) == (y))

//============================================================================
//							类型定义
//============================================================================
/******
typedef unsigned char u8;
typedef signed char s8;
typedef unsigned int u16;
typedef signed int s16;
typedef unsigned long u32;
typedef signed long s32;
********/
#endif













